In [1]:
import pandas as pd

# series object

data=[1,2,3,4,5]
srs=pd.Series(data)
print(srs)

In [12]:
data=[1,2,3,4,5]
srs=pd.Series(data)
print(srs[:2])

0    1
1    2
dtype: int64

In [7]:
data=[1,2,3,4,5]
srs=pd.Series(data,index=['a','b','c','d','e'])
print(srs['b':'d'])

b    2
c    3
d    4
dtype: int64

# DATA FRAME

In [13]:
data=[[1,2,3,4,5],[1,2,3]]
df=pd.DataFrame(data)
df

   0  1  2    3    4
0  1  2  3  4.0  5.0
1  1  2  3  NaN  NaN

In [20]:
data={"a":[1,2,3,4,5],"b":[2,3,4,5,6]}
df=pd.DataFrame(data)
print(df)

   a  b
0  1  2
1  2  3
2  3  4
3  4  5
4  5  6

# Creatinng Dictionary

In [23]:
data ={"a":['apple','mango','banana'],"b":[10,12,15]}
df=pd.DataFrame(data)
print(df)

        a   b
0   apple  10
1   mango  12
2  banana  15

In [24]:
data=pd.Series([6,12],index=['a','b'])
df=pd.DataFrame([data])
df

   a   b
0  6  12

# Join Merge or concat

In [27]:
df=pd.DataFrame({"A":[1,2,3],"B":[2,3,4]})
df

   A  B
0  1  2
1  2  3
2  3  4

In [28]:
df1=pd.DataFrame({"A":[3,4,5],"C":[1,9,10]})
df1

   A   C
0  3   1
1  4   9
2  5  10

In [32]:
pd.concat([df,df1],axis=0,join="inner")

   A
0  1
1  2
2  3
0  3
1  4
2  5

In [33]:
pd.concat([df,df1],axis=1,join="inner")

   A  B  A   C
0  1  2  3   1
1  2  3  4   9
2  3  4  5  10

In [38]:
pd.merge(df,df1,on=["A"],how='inner')

   A  B  C
0  3  4  1

In [39]:
pd.merge(df,df1,on=["A"],how='right')

   A    B   C
0  3  4.0   1
1  4  NaN   9
2  5  NaN  10

In [40]:
pd.merge(df,df1,on=["A"],how='left')

   A  B    C
0  1  2  NaN
1  2  3  NaN
2  3  4  1.0